app/views/blogs/_form.html.erb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% if @topics.each.count > 0 %>
      <%= form.collection_select(:topic_id, Topic.all, :id, :title, {selected: blog.topic.id, include_blank: true}, class: 'form-control') %>