app/controllers/blogs_controller.rb

  def index
    if logged_in?(:site_admin)
      @blogs = Blog.set_order.page(params[:page]).per(5)
---
SELECT  "blogs".* FROM "blogs" ORDER BY updated_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 10]]
SELECT COUNT(*) FROM "blogs"

  def show

    if ! logged_in?(:site_admin) && @blog.status == "draft"
      flash[:alert] = "You are not allowed to view that blog"
      redirect_to blogs_path
    end
    @blog = Blog.includes(:comments).friendly.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = 11

  def new
    @blog = Blog.new
    @page_title = "#{@name} | New Blog"
    @topics = Topic.all
---
SELECT  "topics".* FROM "topics" ORDER BY "topics"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug", "topic_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "topic_id" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["topic_id", 2], ["updated_at", "2017-07-19 15:45:36.046512"], ["id", 1]]

  def create_topic
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("title", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "title"], ["created_at", "2017-07-19 16:23:11.214751"], ["updated_at", "2017-07-19 16:23:11.214751"], ["slug", "title"]]

  def topic_search
    if logged_in?(:site_admin)
      @blogs = Topic.friendly.find(params[:id]).blogs.set_order.page(params[:page]).per(5)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."topic_id" = $1 ORDER BY updated_at DESC LIMIT $2 OFFSET $3  [["topic_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."topic_id" = $1  [["topic_id", 1]]

    def set_topics
      @topics = Topic.includes(:blogs).where.not(blogs: {id: nil})
---
SELECT  "topics".* FROM "topics" ORDER BY "topics"."id" DESC LIMIT $1  [["LIMIT", 1]]