app/controllers/pages_controller.rb

  def about
    @page_title = "#{@name} | About"
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"