app/controllers/portfolios_controller.rb

    def sort
        params[:order].each do |key, value|
           Portfolio.find(value[:id]).update(position: value[:position])
---
UPDATE "portfolios" SET "position" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["position", 1], ["updated_at", "2017-07-12 16:57:30.153194"], ["id", 2]]