app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios" ORDER BY position DEC
---
    def index
       @portfolio_items = Portfolio.all

INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "title is not a title"], ["subtitle", "subtitle is !"], ["body", "body"], ["created_at", "2017-07-17 14:44:52.450660"], ["updated_at", "2017-07-17 14:44:52.450660"]]
---
    def create
        @portfolio = Portfolio.new(portfolio_params)

        respond_to do |format|
            if @portfolio.save

UPDATE "portfolios" SET "main_image" = $1, "thumb_image" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4  [["main_image", "mountains.jpg"], ["thumb_image", "trees.jpg"], ["updated_at", "2017-07-17 15:08:15.470510"], ["id", 11]]
---
    def update

        respond_to do |format|
            if @portfolio_item.update(portfolio_params)

DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 1]]
---
    def destroy


       #destroy record
       @portfolio_item.destroy

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        def set_portfolio
           @portfolio_item = Portfolio.find(params[:id])